In [63]:
import numpy as np
import pandas as pd

In [ ]:
#4.1.1
#(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

#(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [6]:
#(1)
s = pd.Series([10,20,30,40],
index = ["A", "B", "C", "D"])
s

A    10
B    20
C    30
D    40
dtype: int64

In [12]:
#(1)
ss = pd.Series([100,200,300,400],
index = ["A", "B", "C", "D"])
ss

A    100
B    200
C    300
D    400
dtype: int64

In [19]:
#(2)
s + ss, ss - s, s * ss, ss / s

(A    110
 B    220
 C    330
 D    440
 dtype: int64,
 A     90
 B    180
 C    270
 D    360
 dtype: int64,
 A     1000
 B     4000
 C     9000
 D    16000
 dtype: int64,
 A    10.0
 B    10.0
 C    10.0
 D    10.0
 dtype: float64)

In [20]:
# 4.1.2 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

#(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

#(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [21]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [26]:
#4.1.3
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [25]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [27]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [30]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df["평균점수"] = ((df['국어'] + df['수학'] + df['영어'])/3)
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [40]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어']['방자']
df["평균점수"] = ((df['국어'] + df['수학'] + df['영어'])/3)
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [47]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667

In [53]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df[2:3]

    국어  영어  수학  평균점수
향단  70  60  80  70.0

In [ ]:
#모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

#10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [65]:
df1 = pd.DataFrame(np.arange(10, 35).reshape(5, 5),
                  index=["a", "b", "c", "d", "e"],
                  columns=["A", "B", "C", "D", "E"])
df1

    A   B   C   D   E
a  10  11  12  13  14
b  15  16  17  18  19
c  20  21  22  23  24
d  25  26  27  28  29
e  30  31  32  33  34

In [68]:
df1.loc["a"]

A    10
B    11
C    12
D    13
E    14
Name: a, dtype: int32

In [70]:
df1.loc["b":"c"]

    A   B   C   D   E
b  15  16  17  18  19
c  20  21  22  23  24

In [71]:
df1.loc[["b", "c"]]

    A   B   C   D   E
b  15  16  17  18  19
c  20  21  22  23  24

In [80]:
import seaborn as sns

In [94]:
#4.4.1
#타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
df4 = titanic = sns.load_dataset("titanic")
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [86]:
#4.4.2
#sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive)인원수를 구하라.
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [87]:
titanic['age'].value_counts()

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [88]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [89]:
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [ ]:
#4.4.3
#(1)타이타닉호 승객의 평균 나이를 구하라.
#(2)타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
#(3)타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [106]:
#(1)
df4['age'].mean()

29.69911764705882

In [ ]:
#4.4.4 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
#(1)20살이 넘으면 성별을 그대로 사용한다.
#(2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [116]:
titanic['category1'] =titanic.apply(lambda r: "adult" if r.age < 20 else "child", axis = 1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age/sex,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,child,child
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,adult,adult
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,child,child
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,child,child

In [136]:
# 4.4.5 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.
df5 = titanic['age'].fillna(titanic['age'].mean(), inplace = True)
df5

In [ ]:
#4.4.6 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.
#(1)성별을 나타내는 문자열 male 또는 female로 시작한다.
#(2)성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
#(3)예를 들어 27살 남성은 male27 값이 된다.
titanic['category2'] =titanic.apply(

In [ ]:
#4.4.7
#타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다. 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [ ]:
#4.4.8
#타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.
#(1)20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
#(2)20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [ ]:
# 4.5.1
#5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

#학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.

#학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [175]:
df_score11 = {
    "국어": [80, 90, 70, 30, 20],
    "영어": [90, 70, 60, 40, 30],
    "수학": [90, 60, 80, 70, 60],
}
columns = ["국어", "영어", "수학"]
index = ["가", "나", "다", "라", "마"]
df_score11 = pd.DataFrame(df_score11,index=index,columns=columns)
df_score11

   국어  영어  수학
가  80  90  90
나  90  70  60
다  70  60  80
라  30  40  70
마  20  30  60

In [181]:
np.random.seed(1)
df_score111 = pd.DataFrame(np.vstack([list('가나다라마'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["이름", "국어", "영어", "수학"])
df_score111

  이름    국어    영어    수학
0  가  0.42  0.09  0.42
1  나  0.72  0.19  0.69
2  다   0.0  0.35   0.2
3  라   0.3   0.4  0.88
4  마  0.15  0.54  0.03

In [185]:
df_score1111 = df_score111.set_index("이름")
df_score1111

      국어    영어    수학
이름
가   0.42  0.09  0.42
나   0.72  0.19  0.69
다    0.0  0.35   0.2
라    0.3   0.4  0.88
마   0.15  0.54  0.03

In [187]:
df_score1 = df_score1111.set_index("국어")
df_score1

        영어    수학
국어
0.42  0.09  0.42
0.72  0.19  0.69
0.0   0.35   0.2
0.3    0.4  0.88
0.15  0.54  0.03

In [191]:
df_score2 = df_score1.reset_index
df_score2

<bound method DataFrame.reset_index of         영어    수학
국어
0.42  0.09  0.42
0.72  0.19  0.69
0.0   0.35   0.2
0.3    0.4  0.88
0.15  0.54  0.03>

In [ ]:
#4.5.2A 반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

#(1)“반”, “번호”, “국어”, “영어”, “수학” 을 열로 가지는 데이터프레임 df_score3을 만든다.

#(2)df_score3을 변형하여 1차 행 인덱스로 “반”을 2차 행 인덱스로 “번호”을 가지는 데이터프레임 df_score4을 만든다.

#(3)데이터 프레임 df_score4에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.

#(4)df_score3을 변형하여 행 인덱스로 “번호”를, 1차 열 인덱스로 “국어”, “영어”, “수학”을, 2차 열 인덱스로 “반”을 가지는 데이터프레임 df_score5을 만든다.

#(5)데이터 프레임 df_score5에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.